<?php

return [
    'account-overview' => 'نظرة عامة على الحساب',
    'twofactor-messagebox' => 'يجب أن يكون تفعل التحقق بخطوتين للمتابعة.',
    'apikey' => 'مفتاح API',
    'sshkey' => 'مفتاح SSH',

    'update-password' => [
        'current' => 'كلمة المرور الحالية',
        'new' => 'كلمة مرور جديدة',
        'requirements' => 'يجب أن تحتوي كلمة المرور الجديدة على 8 أحرف على الأقل وتكون خاصة لهذا الموقع.',
        'confirm' => 'تأكيد كلمة المرور الجديدة',
        'update' => 'تحديث كلمة المرور',
    ],

    'update-email' => [
        'isUpdated' => 'تم تحديث البريد الإلكتروني الأساسي الخاص بك',
        'update' => 'تحديث البريد الإلكتروني',
        'email' => 'البريد الإلكتروني',
        'confirm' => 'تأكيد كلمة المرور',
    ],

    'appearance' => [
        'title' => 'المظهر',
        'lightDarkMode' => 'الفاتح/الداكن',
        'light' => 'فاتح',
        'dark' => 'داكن',
        'language' => 'لغة الواجهة',
        'panel-sounds' => 'أصوات الواجهة',
        'on' => 'مفعل',
        'off' => 'معطل',
    ],

    'twofactor' => [
        'title' => 'التحقق بخطوتين',
        'isEnabled' => 'تم تفعيل التحقق بخطوتين على حسابك',
        'isDisabled' => 'التحقق بخطوتين غير مفعل على حسابك. انقر على الزر أدناه لبدء التفعيل',
        'disable' => 'تعطيل التحقق بخطوتين',
        'enable' => 'تفعيل التحقق بخطوتين',
        
        'disable-dialog' => [
            'password' => 'كلمة المرور',
            'cancel' => 'إلغاء',
            'must-enter-password' => 'يجب عليك إدخال كلمة مرور حسابك للمتابعة.',
            'disable' => 'تعطيل',
        ],

        'setup-dialog' => [
            'description' => 'امسح رمز الاستجابة السريعة أعلاه باستخدام تطبيق المصادقة بخطوتين الذي تختاره. ثم أدخل الرمز المكون من 6 أرقام الذي تم إنشاؤه في الحقل أدناه.',
            'account-password' => 'كلمة مرور الحساب',
            'qrcode-loading' => 'في انتظار تحميل رمز الاستجابة السريعة...',
            'enter-6digit-password' => 'يجب عليك إدخال الرمز المكون من 6 أرقام وكلمة المرور للمتابعة.',
            'enable' => 'تفعيل',
            'cancel' => 'إلغاء',
        ],
    ],

    'apiKey' => [
        'label' => 'الوصف',
        'description' => 'وصف لاستخدامك (API)',
        'allowedIPs-label' => 'الآيبي المسموح به',
        'allowedIPs-description' => 'اتركه فارغًا للسماح لأي عنوان ايبي باستخدام مفتاح الواجهة البرمجية هذا، وإلا قدم كل عنوان ايبي في سطر جديد.',
        'createButton' => 'إنشاء',

        'your-keys' => 'مفاتيح (API)',
        'store-save' => 'يظهر المفتاح الذي طلبته أدناه. يرجى تخزينه في مكان آمن، لن يتم عرضه مرة أخرى.',
        'close' => 'إغلاق',

        'delete-api-key' => 'حذف مفتاح (API)',
        'delete-key' => 'حذف المفتاح',
        'all-requests-invalidated-1' => 'سيتم إبطال جميع الطلبات باستخدام',
        'all-requests-invalidated-2' => 'سيتم إبطال المفتاح.',
        'loading' => 'جار التحميل...',
        'no-key-found' => 'لا توجد مفاتيح لهذا الحساب (API)',
        'last-used' => 'آخر استخدام',
    ],

    'sshKey' => [
        'loading' => 'جار التحميل...',
        'no-key-found' => 'لا توجد مفاتيح SSH لهذا الحساب.',
        'added-on' => 'تمت الإضافة في',

        'createForm' => [
            'key-name' => 'اسم مفتاح SSH',
            'public-key' => 'المفتاح العام',
            'public-key-desc' => 'أدخل المفتاح العام الخاص بك.',
            'save' => 'حفظ',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'حذف مفتاح SSH',
            'delete-key' => 'حذف المفتاح',
            'will-invalidate-1' => 'سيؤدي إزالة المفتاح',
            'will-invalidate-2' => 'SSH إلى إبطال استخدامه في الواجهة.',
        ],
    ],

    'recoveryTokensDialog' => [
        'title' => 'تم تفعيل التحقق بخطوتين',
        'description' => 'قم بتخزين الرموز أدناه في مكان آمن. إذا فقدت الوصول إلى هاتفك، يمكنك استخدام هذه الرموز الاحتياطية لتسجيل الدخول.',
        'alert' => 'لن يتم عرض هذه الرموز مرة أخرى.',
        'doneButton' => 'تم',
    ],
];
