<?php

return [
    'support' => 'الدعم الفني',

    'login' => [
        'title' => 'تسجيل الدخول للمتابعة',
        'username-or-email' => 'اسم المستخدم أو البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'forgot-password' => 'نسيت كلمة المرور؟',
        'login' => 'تسجيل الدخول',

        'must-be-provided' => 'يجب توفير اسم المستخدم أو البريد الإلكتروني.',
        'please-enter-password' => 'يرجى إدخال كلمة مرور حسابك',
    ],

    'forgot' => [
        'title' => 'طلب إعادة تعيين كلمة المرور',
        'email' => 'البريد الإلكتروني',
        'email-description' => 'أدخل عنوان البريد الإلكتروني الخاص بحسابك لتلقي تعليمات إعادة تعيين كلمة المرور.',
        'send-email' => 'إرسال البريد الإلكتروني',
        'return-to-login' => 'العودة إلى تسجيل الدخول',

        'a-valid-email-provided' => 'يجب توفير عنوان بريد إلكتروني صالح للمتابعة.',
    ],

    'device' => [
        'title' => 'فحص الجهاز',
        'recovery-code' => 'رمز الاسترداد',
        'authentication-code' => 'رمز التحقق',

        'continue' => 'المتابعة',

        'lost-device' => 'لقد فقدت جهازي',
        'have-device' => 'لدي جهازي',

        'return-to-login' => 'العودة إلى تسجيل الدخول',

        'enter-one-of-recovery-codes' => 'أدخل أحد رموز الاسترداد التي تم إنشاؤها عند إعداد التحقق بخطوتين على هذا الحساب للمتابعة.',
        'enter-two-factor' => 'أدخل رمز التحقق بخطوتين الذي تم إنشاؤه بواسطة جهازك',
    ],

    'reset' => [
        'title' => 'إعادة تعيين كلمة المرور',

        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'confirm-password' => 'تأكيد كلمة المرور الجديدة',

        'return-to-login' => 'العودة إلى تسجيل الدخول',

        'password-required' => 'مطلوب كلمة مرور جديدة.',
        'at-least-8-characters' => 'يجب أن تحتوي كلمة المرور الجديدة على 8 أحرف على الأقل.',
        'password-does-not-match' => 'كلمة المرور الجديدة غير متطابقة.',
    ]
];
